{
  "backend/main.mo": "Actor implementing product catalog, user profiles, orders, and admin‑restricted product management with access control and Stripe session integration.",
  "feature_evidence.json": "Feature evidence report listing implemented features, their related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short descriptions of their responsibilities for documentation or build analysis.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light and dark modes with shared styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes, global providers, and layout, including the admin products route.",
  "frontend/src/cart/CartProvider.tsx": "React context managing cart state with add, update, remove, and persistence via localStorage.",
  "frontend/src/cart/cartTypes.ts": "Defines cart item types and helpers to compute totals and item counts.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with about text, navigation links, social icons, and a dynamic copyright line.",
  "frontend/src/components/layout/Header.tsx": "Implements the responsive site header with navigation, search, category filters, admin link logic, and mobile menu.",
  "frontend/src/components/layout/StoreLayout.tsx": "Wraps pages with a shared header, footer, and main outlet container.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product with image, details, price, and an add‑to‑cart button using card UI.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAddProduct.ts": "Mutation hook to add a product via the actor and refresh product and category queries.",
  "frontend/src/hooks/useCategories.ts": "Fetches the list of product categories from the backend actor.",
  "frontend/src/hooks/useCreateOrder.ts": "Mutation hook to create an order with customer info, items, and total amount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useIsAdmin.ts": "Checks whether the authenticated user is an admin using the backend actor.",
  "frontend/src/hooks/useOrder.ts": "Fetches a single order by ID using the backend actor.",
  "frontend/src/hooks/useProduct.ts": "Retrieves a single product by ID from the backend actor.",
  "frontend/src/hooks/useProducts.ts": "Fetches the full product list from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and a warm color theme with light/dark variants.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with store story, offerings, and artisan commitment text.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin-only form page for adding new products with image upload, validation, and authentication handling.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, line totals, and navigation to checkout or shopping.",
  "frontend/src/pages/CheckoutPage.tsx": "Collects customer details, creates orders, and handles login and payment flow before clearing the cart.",
  "frontend/src/pages/ContactPage.tsx": "Static contact information page showing email, phone, and address details.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order status, customer info, items, and payment state based on a loaded order ID.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays a single product’s details with image, pricing, stock, and an add‑to‑cart action.",
  "frontend/src/pages/ShopPage.tsx": "Displays a product listing page with search and category filtering and shows loading or empty states.",
  "frontend/src/payments/PaymentButton.tsx": "Triggers creation of a Stripe checkout session and redirects the user while handling errors and order tracking.",
  "frontend/src/payments/PaymentFailurePage.tsx": "Updates an order as failed on load and offers retry or navigation options after a payment failure.",
  "frontend/src/payments/PaymentSetupPanel.tsx": "Admin-only form for configuring Stripe with secret keys and allowed countries using React Query.",
  "frontend/src/payments/PaymentSuccessPage.tsx": "Verifies Stripe session status, updates order payment to paid if successful, and redirects to the order page.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "React Query mutation creating a Stripe checkout session via backend and returning the session URL.",
  "frontend/src/storefront/filtersStore.ts": "Zustand store managing product search text and selected category.",
  "frontend/src/utils/money.ts": "Formats a price in cents into a US dollar currency string.",
  "frontend/src/utils/productImages.ts": "Maps product image references to generated image URLs, handling data URLs and external links.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theming, colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Defines the current project state, listing existing admin product management features and one pending new feature request."
}