{
  "backend/main.mo": "Motoko backend actor handling user profiles, product catalog, orders, and Stripe-related checkout with access control.",
  "feature_evidence.json": "JSON report mapping implemented features to source files, components, and requirements with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference or documentation.",
  "frontend/index.css": "Tailwind CSS setup defining design tokens, light/dark theme variables, and global base styles.",
  "frontend/index.html": "Base HTML wrapper providing the root element and loading the main React entrypoint.",
  "frontend/src/App.tsx": "Main React app configuring routing, theming, and global providers for cart, toasts, and layout.",
  "frontend/src/cart/CartProvider.tsx": "React context managing cart state with add, update, remove, clear operations and localStorage persistence.",
  "frontend/src/cart/cartTypes.ts": "Type definitions and helper functions for cart items, totals, and quantity calculations.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with about text, quick links, social icons, and attribution section.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, nav links, search, category filters, cart icon, and mobile menu using router, filters, and cart state.",
  "frontend/src/components/layout/StoreLayout.tsx": "Wraps the app layout with Header, Footer, and a main content outlet.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product card with image, details, price, and an add‑to‑cart button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing related queries when it changes.",
  "frontend/src/hooks/useCategories.ts": "Fetches product categories from the actor when available.",
  "frontend/src/hooks/useCreateOrder.ts": "Mutation hook for creating an order through the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, stored identity loading, and auth client configuration.",
  "frontend/src/hooks/useOrder.ts": "Fetches a single order by ID using the actor.",
  "frontend/src/hooks/useProduct.ts": "Fetches a single product by ID from the actor.",
  "frontend/src/hooks/useProducts.ts": "Fetches the full product list from the actor.",
  "frontend/src/index.css": "Tailwind setup with custom theme variables, dark mode, typography, and utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing the store’s story, offerings, and values.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item controls, totals, and empty‑cart handling.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page handling customer details, authentication, order creation, and payment initiation.",
  "frontend/src/pages/ContactPage.tsx": "Static contact page showing email, phone, address, and support info.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order status, customer info, items, and payment status after checkout.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Product detail view with image, description, price, stock, and add‑to‑cart support.",
  "frontend/src/pages/ShopPage.tsx": "Product listing page with search, category filtering, and hero banner.",
  "frontend/src/payments/PaymentButton.tsx": "Triggers Stripe checkout session creation and redirects for payment.",
  "frontend/src/payments/PaymentFailurePage.tsx": "Handles failed payments, updates order status, and offers retry navigation.",
  "frontend/src/payments/PaymentSetupPanel.tsx": "Admin‑only UI for configuring Stripe secret key and allowed countries.",
  "frontend/src/payments/PaymentSuccessPage.tsx": "Processes Stripe checkout success by verifying session status, updating order payment, clearing session data, and redirecting to the order page while showing a loading spinner.",
  "frontend/src/payments/useCreateCheckoutSession.ts": "Creates a Stripe checkout session via the backend actor and returns the session URL using a React Query mutation.",
  "frontend/src/storefront/filtersStore.ts": "Zustand store managing search text and selected product category with simple setter actions.",
  "frontend/src/utils/money.ts": "Formats a price in cents into a USD currency string using Intl.NumberFormat.",
  "frontend/src/utils/productImages.ts": "Maps product image filenames to generated asset URLs with a fallback image.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Project metadata describing the e‑commerce site's purpose, architecture notes, features, and image requirements."
}