{
  "kind": "build_request",
  "title": "Add admin product upload/add-product workflow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an admin-only Product Management page that lets the store owner add new products to the catalog from the live website.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "now how i add product in that website and how to upload my product"
        ]
      },
      "acceptanceCriteria": [
        "A new route exists for product management (e.g., /admin/products) and is reachable from the UI.",
        "The page requires Internet Identity login; when not logged in, the page shows a clear prompt to sign in.",
        "The page checks admin status using the backend and hides/blocks product management UI for non-admin users with a clear error message.",
        "The page contains a product creation form for: name, description, priceInCents, category, stock, and image.",
        "Submitting the form successfully calls the backend admin method to add the product and the new product appears in the Shop product list without a manual refresh (React Query invalidation/refetch)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement product image “upload” support in the admin add-product form by allowing the admin to choose a local image file and store it as a data URL in the product’s imageRef, with a preview before saving.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "how to upload my product"
        ]
      },
      "acceptanceCriteria": [
        "The add-product form includes an image file input that accepts common formats (at least PNG and JPEG).",
        "When an image file is selected, the UI shows a preview of the image.",
        "On submit, the image is stored in product.imageRef as a data URL string, and the product cards/details pages render it correctly.",
        "If no image is selected, the product still saves and uses the existing fallback product image behavior."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update product image rendering so Product.imageRef can be either (1) an existing mapped filename (current behavior) or (2) a direct URL/data URL (new behavior).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "how to upload my product"
        ]
      },
      "acceptanceCriteria": [
        "If product.imageRef starts with \"data:\" it is used directly as the image src.",
        "If product.imageRef starts with \"http://\" or \"https://\" it is used directly as the image src.",
        "Otherwise, the existing filename-to-generated-asset mapping remains in effect and continues to work for seeded products."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Expose an entry point to the admin product management page from the main UI, visible only to admins.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "now how i add product in that website"
        ]
      },
      "acceptanceCriteria": [
        "Header navigation includes an “Admin” or “Manage Products” link/button when the signed-in user is an admin.",
        "Non-admin users never see the admin navigation entry.",
        "On mobile, the admin entry is also available in the mobile menu when the user is an admin."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Provide a simple in-app “How to add products” help section on the admin product management page describing the required fields and how image upload works.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "now how i add product in that website and how to upload my product"
        ]
      },
      "acceptanceCriteria": [
        "The admin product page includes a short help section in English explaining: required fields, pricing in cents (with an example), stock behavior, and image upload/preview.",
        "The help text is visible without leaving the page (no external links required)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Backend must remain a single Motoko actor in backend/main.mo; add new backend methods only if required for the product management workflow."
  ],
  "nonGoals": [
    "Implementing full CRUD for products (edit/update/delete) unless required to support adding/uploading.",
    "Storing uploaded images as separate binary assets served by the backend canister (use data URLs in imageRef as specified).",
    "Adding third-party authentication providers (only Internet Identity)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}