{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin add-product workflow (frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an admin-only Product Management page with Internet Identity login gating, admin check, and an add-product form that updates the Shop list via React Query invalidation.",
      "acceptanceCriteria": [
        "A new route exists for product management (e.g., /admin/products) and is reachable from the UI.",
        "The page requires Internet Identity login; when not logged in, the page shows a clear prompt to sign in.",
        "The page checks admin status using the backend and hides/blocks product management UI for non-admin users with a clear error message.",
        "The page contains a product creation form for: name, description, priceInCents, category, stock, and image.",
        "Submitting the form successfully calls the backend admin method to add the product and the new product appears in the Shop product list without a manual refresh (React Query invalidation/refetch)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminProductsPage.tsx",
          "operation": "create",
          "description": "Create the admin Product Management page at /admin/products. Use the authorization flow (Internet Identity) to show a sign-in prompt when logged out, then check admin status via the backend capability (isCallerAdmin) and block non-admins with a clear message. Include an add-product form (name, description, priceInCents, category, stock, image) that calls the backend capability (addProduct) and clears the form on success. Use shadcn-ui building blocks (e.g., Card, Button, Input, Label) for consistent layout/styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useIsAdmin.ts",
          "operation": "create",
          "description": "Add a reusable React Query hook that queries the backend capability (isCallerAdmin) when an authenticated identity is present, and returns loading/error states for admin gating. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAddProduct.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook wrapping the backend capability (addProduct) and invalidating/refetching the ['products'] query on success so the Shop list updates without a manual refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new route (e.g., /admin/products) using @tanstack/react-router, and wire it to the new AdminProductsPage component so it is navigable. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement image file selection in the add-product form, preview it, and store it as a data URL in product.imageRef (with fallback when omitted).",
      "acceptanceCriteria": [
        "The add-product form includes an image file input that accepts common formats (at least PNG and JPEG).",
        "When an image file is selected, the UI shows a preview of the image.",
        "On submit, the image is stored in product.imageRef as a data URL string, and the product cards/details pages render it correctly.",
        "If no image is selected, the product still saves and uses the existing fallback product image behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Add an image file input (accept at least image/png and image/jpeg) to the add-product form. Read the selected file as a data URL (FileReader) into component state, show an inline preview, and submit the data URL string as product.imageRef; if no file is selected, submit an empty string (or existing default) so current fallback image behavior applies. Use shadcn-ui form components where appropriate; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update product image rendering to support imageRef values that are data URLs or http(s) URLs while preserving existing filename mapping.",
      "acceptanceCriteria": [
        "If product.imageRef starts with \"data:\" it is used directly as the image src.",
        "If product.imageRef starts with \"http://\" or \"https://\" it is used directly as the image src.",
        "Otherwise, the existing filename-to-generated-asset mapping remains in effect and continues to work for seeded products."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/productImages.ts",
          "operation": "modify",
          "description": "Update getProductImageUrl(imageRef) to return imageRef directly when it starts with 'data:' or 'http://' or 'https://'. Otherwise keep the current filename-to-generated-asset mapping and fallback behavior unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add an admin-only navigation entry to reach the Product Management page from the main UI (desktop + mobile).",
      "acceptanceCriteria": [
        "Header navigation includes an “Admin” or “Manage Products” link/button when the signed-in user is an admin.",
        "Non-admin users never see the admin navigation entry.",
        "On mobile, the admin entry is also available in the mobile menu when the user is an admin."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Add an admin-only navigation entry (e.g., 'Manage Products') that routes to /admin/products. Gate visibility by authenticated identity + backend admin check (reuse the new useIsAdmin hook). Ensure the entry appears in both desktop nav and the mobile Sheet menu, and is never shown for non-admins. Use existing shadcn-ui components already used by Header (Button, Sheet, etc.); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useIsAdmin.ts",
          "operation": "modify",
          "description": "Ensure the admin-check hook exposes a simple boolean and loading state suitable for Header rendering (avoid flashing admin links for unknown state). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add an in-page help section on the admin product management page explaining required fields and image upload behavior.",
      "acceptanceCriteria": [
        "The admin product page includes a short help section in English explaining: required fields, pricing in cents (with an example), stock behavior, and image upload/preview.",
        "The help text is visible without leaving the page (no external links required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Add a visible, concise 'How to add products' help section on the page describing: required fields, priceInCents with an example (e.g., 1999 = $19.99), stock meaning/behavior, and how image selection + preview works (data URL stored in imageRef). Use shadcn-ui layout components (e.g., Card/Alert styling) for readability; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}